package ch02;

/*
 컴퓨터(CPU)는 구조상 덧셈연산을 할 수 있다
 컴퓨터(CPU)는 구조상 뺄셈연산을 할 수 없다.
 컴퓨터(CPU)에서 구조상 뺄셈요청시 뻴셈처리를 할 수 있다.
 보수계념을 도입해서 뺄셈처리를 수행하기 때문에 가능
 
 
 				//문제
		//음수값임을 고려하여 풉니다
		//10 진수 	-> 2진수
		//111 		-> 01101111
		//-111 		-> 10010001
		//96		-> 01100000
		//-96		-> 10100000
		//31 		-> 00011111
		//-31		-> 11100001 
		
		//2진수		-> 10진수
		//10101111 	-> -128 + 32 + 8 + 4 + 2 + 1
		//00110101	->  32 + 16 + 4 + 1
		//11001100	-> -128 + 64 + 8 + 4
		//10101010	-> -128 + 32 + 8 + 2
*/

public class c02음수 {

	public static void main(String[] args) {
		
		
	}

}
